OpenFOAM/run/prescribedU/shearFlow3D/baseCase/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.0.1                                 |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;
    class           dictionary;
	location		"system";
    object          controlDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     interFlow;

startFrom       latestTime;

startTime       0.0;

stopAt          endTime;

endTime         3.0;

writeControl    adjustableRunTime;

writeInterval   0.1;

deltaT          0.0005;

purgeWrite      0;

writeFormat     ascii;

writePrecision  14;

writeCompression uncompressed;

timeFormat      general;

timePrecision   6;

graphFormat     raw;

runTimeModifiable yes;

adjustTimeStep  yes;

maxCo           1e10;
maxAlphaCo      0.5;

maxDeltaT       0.2;

libs ( "libVOFInterpolationSchemes.so" );

// ************************************************************************* //
